org/prototypage/LG476_pinname.org
#+author: remi.griot@efrei.fr
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+OPTIONS: num:nil
#+LINK_UP: 
#+LINK_HOME: index.html

Dans Keil Studio, le fichier definissant le nom des broches du composant est \\
TARGET​_STM​/TARGET​_STM32L4​/TARGET​_STM32L476xG/pinNames.h \\

Voici un tableau permettant de faire le lien entre les noms des broches du composants (schéma),
 les noms utilisés par Keil et le connecteur au format Arduino situé sur la carte. Ainsi, une même broche peut être appelé par différent nom dans le code, suivant si l'utilisateur utilise le connecteur Arduino ou Morpho

| Schéma | Keil IDE | Arduino (Keil IDE) | Autre nom  |
|--------+----------+--------------------+------------|
| PA0   | PA​_0  ​   | ARDUINO​_UNO​_A0     |            |
| PA1   | PA​_1     | ARDUINO​_UNO​_A1     |            |
| PA2   | PA​_2     | ARDUINO​_UNO​_D1     | CONSOLE​_TX |
| PA3   | PA​_3     | ARDUINO​_UNO​_D0     | CONSOLE​_RX |
| PA4   | PA​_4     | ARDUINO​_UNO​_A2     |            |
| PA5   | PA​_5     | ARDUINO​_UNO​_D13    | LED1       |
| PA6   | PA​_6     | ARDUINO​_UNO​_D12    |            |
| PA7   | PA​_7     | ARDUINO​_UNO​_D11    |            |
| PA8   | PA​_8     | ARDUINO​_UNO​_D7     |            |
| PA9   | PA​_9     | ARDUINO​_UNO​_D8     |            |
| PA10  | PA​_10    | ARDUINO​_UNO​_D2     |            |
| PA11  | PA​_11    |                    |            |
| PA12  | PA​_12    |                    |            |
| PA13  | PA​_13    |                    |            |
| PA14  | PA​_14    |                    |            |
| PA15  | PA​_15    |                    |            |
| PB0   | PB​_0     | ARDUINO​_UNO​_A3     |            |
| PB1   | PB​_1     | ​    ​               |            |
| PB2   | PB​_2     | ​    ​               |            |
| PB3   | PB​_3     | ARDUINO​_UNO​_D3     |            |
| PB4   | PB​_4     | ARDUINO​_UNO​_D5     |            |
| PB5   | PB​_5     | ARDUINO​_UNO​_D4     |            |
| PB6   | PB​_6     | ​    ​               |            |
| PB7   | PB​_7     | ​    ​               |            |
| PB8   | PB​_8     | ARDUINO​_UNO​_D15    |            |
| PB9   | PB​_9     | ARDUINO​_UNO​_D14    |            |
| PB10  | PB​_10    | ARDUINO​_UNO​_D6     |            |
| PB11  | PB​_11    | ​    ​               |            |
| PB12  | PB​_12    | ​    ​               |            |
| PB13  | PB​_13    | ​    ​               |            |
| PB14  | PB​_14    | ​    ​               |            |
| PB15  | PB​_15    | ​    ​               |            |
| PC0   | PC​_0     | ARDUINO​_UNO​_A5     |            |
| PC1   | PC​_1     | ARDUINO​_UNO​_A4     |            |
| PC2   | PC​_2     | ​    ​               |            |
| PC3   | PC​_3     | ​    ​               |            |
| PC4   | PC​_4     | ​    ​               |            |
| PC5   | PC​_5     | ​    ​               |            |
| PC6   | PC​_6     | ARDUINO​_UNO​_D10    |            |
| PC7   | PC​_7     | ARDUINO​_UNO​_D9     |            |
| PC8   | PC​_8     |                    |            |
| PC9   | PC​_9     |                    |            |
| PC10  | PC​_10    |                    |            |
| PC11  | PC​_11    |                    |            |
| PC12  | PC​_12    |                    |            |
| PC13  | PC​_13    |                    | BUTTON1    |
| PC14  | PC​_14    |                    |            |
| PC15  | PC​_15    |                    |            |
| PD2   | PD​_2     |                    |            |
| PH0   | PH​_0     |                    |            |
| PH1   | PH​_1     |                    |            |
