html/LG476_pinname.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>





</head>
<body>
<div id="content">
<p>
Dans Keil Studio, le fichier definissant le nom des broches du composant est <br />
TARGET​_STM​/TARGET​_STM32L4​/TARGET​_STM32L476xG/pinNames.h <br />
</p>

<p>
Voici un tableau permettant de faire le lien entre les noms des broches du composants (schéma),
 les noms utilisés par Keil et le connecteur au format Arduino situé sur la carte. Ainsi, une même broche peut être appelé par différent nom dans le code, suivant si l'utilisateur utilise le connecteur Arduino ou Morpho
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Schéma</th>
<th scope="col" class="org-left">Keil IDE</th>
<th scope="col" class="org-left">Arduino (Keil IDE)</th>
<th scope="col" class="org-left">Autre nom</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">PA0</td>
<td class="org-left">PA​_0  ​</td>
<td class="org-left">ARDUINO​_UNO​_A0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PA1</td>
<td class="org-left">PA​_1</td>
<td class="org-left">ARDUINO​_UNO​_A1</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PA2</td>
<td class="org-left">PA​_2</td>
<td class="org-left">ARDUINO​_UNO​_D1</td>
<td class="org-left">CONSOLE​_TX</td>
</tr>

<tr>
<td class="org-left">PA3</td>
<td class="org-left">PA​_3</td>
<td class="org-left">ARDUINO​_UNO​_D0</td>
<td class="org-left">CONSOLE​_RX</td>
</tr>

<tr>
<td class="org-left">PA4</td>
<td class="org-left">PA​_4</td>
<td class="org-left">ARDUINO​_UNO​_A2</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PA5</td>
<td class="org-left">PA​_5</td>
<td class="org-left">ARDUINO​_UNO​_D13</td>
<td class="org-left">LED1</td>
</tr>

<tr>
<td class="org-left">PA6</td>
<td class="org-left">PA​_6</td>
<td class="org-left">ARDUINO​_UNO​_D12</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PA7</td>
<td class="org-left">PA​_7</td>
<td class="org-left">ARDUINO​_UNO​_D11</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PA8</td>
<td class="org-left">PA​_8</td>
<td class="org-left">ARDUINO​_UNO​_D7</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PA9</td>
<td class="org-left">PA​_9</td>
<td class="org-left">ARDUINO​_UNO​_D8</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PA10</td>
<td class="org-left">PA​_10</td>
<td class="org-left">ARDUINO​_UNO​_D2</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PA11</td>
<td class="org-left">PA​_11</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PA12</td>
<td class="org-left">PA​_12</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PA13</td>
<td class="org-left">PA​_13</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PA14</td>
<td class="org-left">PA​_14</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PA15</td>
<td class="org-left">PA​_15</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PB0</td>
<td class="org-left">PB​_0</td>
<td class="org-left">ARDUINO​_UNO​_A3</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PB1</td>
<td class="org-left">PB​_1</td>
<td class="org-left">​    ​</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PB2</td>
<td class="org-left">PB​_2</td>
<td class="org-left">​    ​</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PB3</td>
<td class="org-left">PB​_3</td>
<td class="org-left">ARDUINO​_UNO​_D3</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PB4</td>
<td class="org-left">PB​_4</td>
<td class="org-left">ARDUINO​_UNO​_D5</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PB5</td>
<td class="org-left">PB​_5</td>
<td class="org-left">ARDUINO​_UNO​_D4</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PB6</td>
<td class="org-left">PB​_6</td>
<td class="org-left">​    ​</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PB7</td>
<td class="org-left">PB​_7</td>
<td class="org-left">​    ​</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PB8</td>
<td class="org-left">PB​_8</td>
<td class="org-left">ARDUINO​_UNO​_D15</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PB9</td>
<td class="org-left">PB​_9</td>
<td class="org-left">ARDUINO​_UNO​_D14</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PB10</td>
<td class="org-left">PB​_10</td>
<td class="org-left">ARDUINO​_UNO​_D6</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PB11</td>
<td class="org-left">PB​_11</td>
<td class="org-left">​    ​</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PB12</td>
<td class="org-left">PB​_12</td>
<td class="org-left">​    ​</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PB13</td>
<td class="org-left">PB​_13</td>
<td class="org-left">​    ​</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PB14</td>
<td class="org-left">PB​_14</td>
<td class="org-left">​    ​</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PB15</td>
<td class="org-left">PB​_15</td>
<td class="org-left">​    ​</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PC0</td>
<td class="org-left">PC​_0</td>
<td class="org-left">ARDUINO​_UNO​_A5</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PC1</td>
<td class="org-left">PC​_1</td>
<td class="org-left">ARDUINO​_UNO​_A4</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PC2</td>
<td class="org-left">PC​_2</td>
<td class="org-left">​    ​</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PC3</td>
<td class="org-left">PC​_3</td>
<td class="org-left">​    ​</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PC4</td>
<td class="org-left">PC​_4</td>
<td class="org-left">​    ​</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PC5</td>
<td class="org-left">PC​_5</td>
<td class="org-left">​    ​</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PC6</td>
<td class="org-left">PC​_6</td>
<td class="org-left">ARDUINO​_UNO​_D10</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PC7</td>
<td class="org-left">PC​_7</td>
<td class="org-left">ARDUINO​_UNO​_D9</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PC8</td>
<td class="org-left">PC​_8</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PC9</td>
<td class="org-left">PC​_9</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PC10</td>
<td class="org-left">PC​_10</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PC11</td>
<td class="org-left">PC​_11</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PC12</td>
<td class="org-left">PC​_12</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PC13</td>
<td class="org-left">PC​_13</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">BUTTON1</td>
</tr>

<tr>
<td class="org-left">PC14</td>
<td class="org-left">PC​_14</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PC15</td>
<td class="org-left">PC​_15</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PD2</td>
<td class="org-left">PD​_2</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PH0</td>
<td class="org-left">PH​_0</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PH1</td>
<td class="org-left">PH​_1</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
<div id="postamble" class="status">
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
